sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
static UTIL_TIMER_Object_t TxPressureMeasureTimer;

static UTIL_TIMER_Object_t TxHumidityMeasureTimer;

static uint8_t AggStateOn = 0;

static uint8_t PressDataOn = 0;

static uint8_t TempDataOn = 0;

static uint8_t HumDataOn = 0;

//

static agg_storage humidity_storage = { 0, 0, 0, 0, 0, 0, 0, 0, { 0, 0, 0, 0, 0 } };

static agg_storage pressure_storage = { 0, 0, 0, 0, 0, 0, 0, 0, { 0, 0, 0, 0, 0 } };

static agg_storage temperature_storage = { 0, 0, 0, 0, 0, 0, 0, 0, { 0, 0, 0, 0, 0 } };

/**
  * @brief User application buffer
  */
static uint8_t AppDataBuffer[LORAWAN_APP_DATA_BUFFER_MAX_SIZE];

/**
  * @brief User application data structure
  */
static LmHandlerAppData_t AppData = { 0, 0, AppDataBuffer };

/**
  * @brief Specifies the state of the application LED
  */
static uint8_t AppLedStateOn = RESET;

//static uint8_t UpdatableAppTxDutycycle = 1000000;

/**
  * @brief Timer to handle the application Tx Led to toggle
  */
static UTIL_TIMER_Object_t TxLedTimer;

/**
  * @brief Timer to handle the application Rx Led to toggle
  */
static UTIL_TIMER_Object_t RxLedTimer;

/**
  * @brief Timer to handle the application Join Led to toggle
  */
static UTIL_TIMER_Object_t JoinLedTimer;

/* USER CODE END PV */

/* Exported functions ---------------------------------------------------------*/
/* USER CODE BEGIN EF */

/* USER CODE END EF */

void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_1 */

  LED_Init(LED_BLUE);
  LED_Init(LED_RED1);
  LED_Init(LED_RED2);

  /* Get LoRa APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APP_VERSION:        V%X.%X.%X\r\n",
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB2_SHIFT));

  /* Get MW LoraWAN info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION: V%X.%X.%X\r\n",
          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB2_SHIFT));

  /* Get MW SubGhz_Phy info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:   V%X.%X.%X\r\n",
          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_SUB2_SHIFT));

  UTIL_TIMER_Create(&TxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&RxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&JoinLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);
  UTIL_TIMER_SetPeriod(&TxLedTimer, 500);
  UTIL_TIMER_SetPeriod(&RxLedTimer, 500);
  UTIL_TIMER_SetPeriod(&JoinLedTimer, 500);

  /* USER CODE END LoRaWAN_Init_1 */

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_CollectMeasurmentsEvent), UTIL_SEQ_RFU, CollectMeasurements);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTemperatureTimerEvent), UTIL_SEQ_RFU, SendTemperatureMeasurements);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnPressureTimerEvent), UTIL_SEQ_RFU, SendPressureMeasurements);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnHumidityTimerEvent), UTIL_SEQ_RFU, SendHumidityMeasurements);
  /* Init Info table used by LmHandler*/
  LoraInfo_Init();

  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks);

  LmHandlerConfigure(&LmHandlerParams);

  /* USER CODE BEGIN LoRaWAN_Init_2 */
  UTIL_TIMER_Start(&JoinLedTimer);

  /* USER CODE END LoRaWAN_Init_2 */

  LmHandlerJoin(ActivationType);

  if (EventType == TX_ON_TIMER)
  {
    /* send every time timer elapses */
	APP_LOG(TS_ON, VLEVEL_L, "LORA SETUP\r\n");

    UTIL_TIMER_Create(&TxTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
    UTIL_TIMER_Create(&DataMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnMeasureDataTimerEvent, NULL);
    UTIL_TIMER_Create(&TxTemperatureMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnMeasureTemperatureTimerEvent, NULL);
    UTIL_TIMER_Create(&TxPressureMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnMeasurePressureTimerEvent, NULL);
    UTIL_TIMER_Create(&TxHumidityMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnMeasureHumidityTimerEvent, NULL);

    UTIL_TIMER_SetPeriod(&TxTimer, APP_TX_DUTYCYCLE);
    UTIL_TIMER_SetPeriod(&DataMeasureTimer, APP_TX_DUTYCYCLE);
    UTIL_TIMER_SetPeriod(&TxTemperatureMeasureTimer, APP_TX_DUTYCYCLE);
    UTIL_TIMER_SetPeriod(&TxPressureMeasureTimer, APP_TX_DUTYCYCLE);
    UTIL_TIMER_SetPeriod(&TxHumidityMeasureTimer, APP_TX_DUTYCYCLE);

    UTIL_TIMER_Start(&TxTimer);
    UTIL_TIMER_Start(&DataMeasureTimer);
    UTIL_TIMER_Start(&TxTemperatureMeasureTimer);
    UTIL_TIMER_Start(&TxPressureMeasureTimer);
    UTIL_TIMER_Start(&TxHumidityMeasureTimer);
  }
  else
  {
    /* USER CODE BEGIN LoRaWAN_Init_3 */

    /* send every time button is pushed */
    BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);
    /* USER CODE END LoRaWAN_Init_3 */
  }

  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
//    case  USER_BUTTON_PIN:
//      UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
//      break;
    default:
      break;
  }
}

/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_1 */
  APP_LOG(TS_ON, VLEVEL_L, "MESSAGE WITH DATA RECEIVED\r");
  if ((appData != NULL) || (params != NULL))
  {
    LED_On(LED_BLUE);

    UTIL_TIMER_Start(&RxLedTimer);

    static const char *slotStrings[] = { "1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot" };

    APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Indication ==========\r\n");
    APP_LOG(TS_OFF, VLEVEL_H, "###### D/L FRAME:%04d | SLOT:%s | PORT:%d | DR:%d | RSSI:%d | SNR:%d\r\n",
            params->DownlinkCounter, slotStrings[params->RxSlot], appData->Port, params->Datarate, params->Rssi, params->Snr);
    APP_LOG(TS_ON, VLEVEL_L, "PORT:%d\r\n", appData->Port);

	uint8_t *buffer;
	nx_json *rulesArray;
	nx_json *aggPar;
	nx_json *condArr;
	nx_json *condSel;
	nx_json *condVal;
	nx_json *condExp;
	nx_json *condPar;
	uint8_t epDur;
	uint8_t status;
	uint8_t i = 0;
	uint8_t j = 0;
	UTIL_TIMER_Time_t nextTxIn = 0;

