sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
    	    			  // END CONDITION

    	    			  temperature_storage.AggStateOn = 1;

    			  		  break;
    			  	  case PRESSURE:
    	    			  APP_LOG(TS_ON, VLEVEL_L, "ENABLING PARAMETER: PRESSURE\r\n");
    	    			  PressDataOn = 1;

    	    			  pressure_storage.AggMaxOn = 0;
    	    			  pressure_storage.AggMinOn = 0;
    	    			  pressure_storage.AggCountOn = 0;
    	    			  pressure_storage.AggAvgOn = 0;
    	    			  pressure_storage.AggSumOn = 0;
    	    			  pressure_storage.AggSqSumOn = 0;

    	    			  aggPar = nx_json_get(item, "agg");

    	    			  // START AGGREGATOR
    	    			  for (i = 0; i < aggPar->children.length; i++) {
    	    			  	const nx_json* item=nx_json_item(aggPar, i);
    	    			    APP_LOG(TS_ON, VLEVEL_L, "ENABLING AGGREGATOR: %s\r\n", item->text_value);

    	    			    if (strcmp((char*)(item->text_value), "MAX") == 0){
    	    			    	pressure_storage.AggMaxOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "MIN") == 0){
    	    			      	pressure_storage.AggMinOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "COUNT") == 0) {
    	    			      	pressure_storage.AggCountOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "AVG") == 0) {
    	    			      	pressure_storage.AggAvgOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "SUM") == 0) {
    	    			      	pressure_storage.AggSumOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "SQSUM") == 0) {
    	    			      	pressure_storage.AggSqSumOn = 1;
    	    			    }
    	    			  }

    	    			  // END AGGREGATOR

    	    			  // START EPOCH DURATION

    	    			  epDur = (uint8_t)atoi(nx_json_get(item, "epDur")->text_value);

    	    			  APP_LOG(TS_ON, VLEVEL_L, "REPORTING PERIOD: %d [s]\r\n", epDur);
    	    			  pressure_storage.epDuration = epDur;

    	    			  UTIL_TIMER_Stop(&TxTimer);

    	    			  UTIL_TIMER_Create(&TxPressureMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
    	    			  UTIL_TIMER_SetPeriod(&TxPressureMeasureTimer, epDur*1000);
    	    			  UTIL_TIMER_Start(&TxPressureMeasureTimer);

    	    			  // END EPOCH DURATION

    	    			  // START CONDITION

    	    			  if (nx_json_get(item, "cond")) {
    	    			  	condSel = nx_json_get(nx_json_get(item, "cond"), "chain");
    	    			    condArr = nx_json_get(nx_json_get(item, "cond"), "agg");

    	    			    if (strcmp((char*)(condSel->text_value), "AND") == 0) {
    	    			    	pressure_storage.condSel = AND;
    	    			    }
    	    			    if (strcmp((char*)(condSel->text_value), "OR") == 0) {
    	    			    	pressure_storage.condSel = OR;
    	    			    }

    	    			    APP_LOG(TS_ON, VLEVEL_L, "ENABLING CONDITION:\r\n");

    	    			    for (j = 0; j < condArr->children.length; j++) {
    	    			    	const nx_json* condItem=nx_json_item(condArr, j);
    	    			      	condVal = nx_json_get(condItem, "val");
    	    			      	condExp = nx_json_get(condItem, "code");
    	    			      	condPar = nx_json_get(condItem, "par");

    	    			      	pressure_storage.aggConditions[j].value = (uint8_t)atoi(condVal->text_value);

    	    			      	APP_LOG(TS_ON, VLEVEL_L, "value: %d\r\n", pressure_storage.aggConditions[j].value);

    	    			      	if (strcmp((char*)(condPar->text_value), "pressure") == 0) {
    	    			      		APP_LOG(TS_ON, VLEVEL_L, "parameter: pressure\r\n");
    	    			      	    pressure_storage.aggConditions[j].parameter = PRESSURE;
    	    			      	}
    	    			      	else if (strcmp((char*)(condPar->text_value), "temperature") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "parameter: temperature\r\n");
    	    			      	    pressure_storage.aggConditions[j].parameter = TEMPERATURE;
    	    			      	}
    	    			      	else if (strcmp((char*)(condPar->text_value), "humidity") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "parameter: humidity\r\n");
    	    			      	    pressure_storage.aggConditions[j].parameter = HUMIDITY;
    	    			      	}

    	    			      	if (strcmp((char*)(condExp->text_value), "G") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: GREATER\r\n");
    	    			      	    pressure_storage.aggConditions[j].condition = GREATER;
    	    			      	}
    	    			      	else if (strcmp((char*)(condExp->text_value), "GE") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: GREATER_THAN_EQUAL\r\n");
    	    			      	    pressure_storage.aggConditions[j].condition = GREATER_THAN_EQUAL;
    	    			      	 }
    	    			      	 else if (strcmp((char*)(condExp->text_value), "L") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: LESS\r\n");
    	    			      	    pressure_storage.aggConditions[j].condition = LESS;
    	    			      	 }
    	    			      	 else if (strcmp((char*)(condExp->text_value), "LE") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: LESS_THAN_EQUAL\r\n");
    	    			      	    pressure_storage.aggConditions[j].condition = LESS_THAN_EQUAL;
    	    			      	 }
    	    			      }

	    			      	 pressure_storage.condSize = j+1;
    	    			  }

    	    			  // END CONDITION

    	    			  pressure_storage.AggStateOn = 1;
    			  		  break;
    			  	  case HUMIDITY:
    	    			  APP_LOG(TS_ON, VLEVEL_L, "ENABLING PARAMETER: HUMIDITY\r\n");
    	    			  HumDataOn = 1;

    	    			  humidity_storage.AggMaxOn = 0;
    	    			  humidity_storage.AggMinOn = 0;
    	    			  humidity_storage.AggCountOn = 0;
    	    			  humidity_storage.AggAvgOn = 0;
    	    			  humidity_storage.AggSumOn = 0;
    	    			  humidity_storage.AggSqSumOn = 0;

    	    			  aggPar = nx_json_get(item, "agg");

    	    			  // START AGGREGATOR
    	    			  for (i = 0; i < aggPar->children.length; i++) {
    	    			  	const nx_json* item=nx_json_item(aggPar, i);
    	    			    APP_LOG(TS_ON, VLEVEL_L, "ENABLING AGGREGATOR: %s\r\n", item->text_value);

    	    			    if (strcmp((char*)(item->text_value), "MAX") == 0){
    	    			    	humidity_storage.AggMaxOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "MIN") == 0){
    	    			    	humidity_storage.AggMinOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "COUNT") == 0) {
    	    			    	humidity_storage.AggCountOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "AVG") == 0) {
    	    			    	humidity_storage.AggAvgOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "SUM") == 0) {
    	    			    	humidity_storage.AggSumOn = 1;
    	    			    }
    	    			    if (strcmp((char*)(item->text_value), "SQSUM") == 0) {
    	    			    	humidity_storage.AggSqSumOn = 1;
    	    			    }
    	    			  }

    	    			  // END AGGREGATOR

