sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
    	    			  // START EPOCH DURATION

    	    			  epDur = (uint8_t)atoi(nx_json_get(item, "epDur")->text_value);

    	    			  APP_LOG(TS_ON, VLEVEL_L, "REPORTING PERIOD: %d [s]\r\n", epDur);
    	    			  humidity_storage.epDuration = epDur;

    	    			  UTIL_TIMER_Stop(&TxTimer);

    	    			  UTIL_TIMER_Create(&TxHumidityMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
    	    			  UTIL_TIMER_SetPeriod(&TxHumidityMeasureTimer, epDur*1000);
    	    			  UTIL_TIMER_Start(&TxHumidityMeasureTimer);

    	    			  // END EPOCH DURATION

    	    			  // START CONDITION

    	    			  if (nx_json_get(item, "cond")) {
    	    			  	condSel = nx_json_get(nx_json_get(item, "cond"), "chain");
    	    			    condArr = nx_json_get(nx_json_get(item, "cond"), "agg");

    	    			    if (strcmp((char*)(condSel->text_value), "AND") == 0) {
    	    			    	humidity_storage.condSel = AND;
    	    			    }
    	    			    if (strcmp((char*)(condSel->text_value), "OR") == 0) {
    	    			    	humidity_storage.condSel = OR;
    	    			    }

    	    			    APP_LOG(TS_ON, VLEVEL_L, "ENABLING CONDITION:\r\n");

    	    			    for (j = 0; j < condArr->children.length; j++) {
    	    			    	const nx_json* condItem=nx_json_item(condArr, j);
    	    			      	condVal = nx_json_get(condItem, "val");
    	    			      	condExp = nx_json_get(condItem, "code");
    	    			      	condPar = nx_json_get(condItem, "par");

    	    			      	humidity_storage.aggConditions[j].value = (uint8_t)atoi(condVal->text_value);

    	    			      	APP_LOG(TS_ON, VLEVEL_L, "value: %d\r\n", humidity_storage.aggConditions[j].value);

    	    			      	if (strcmp((char*)(condPar->text_value), "pressure") == 0) {
    	    			      		APP_LOG(TS_ON, VLEVEL_L, "parameter: pressure\r\n");
    	    			      		humidity_storage.aggConditions[j].parameter = PRESSURE;
    	    			      	}
    	    			      	else if (strcmp((char*)(condPar->text_value), "temperature") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "parameter: temperature\r\n");
    	    			      	    humidity_storage.aggConditions[j].parameter = TEMPERATURE;
    	    			      	}
    	    			      	else if (strcmp((char*)(condPar->text_value), "humidity") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "parameter: humidity\r\n");
    	    			      	    humidity_storage.aggConditions[j].parameter = HUMIDITY;
    	    			      	}

    	    			      	if (strcmp((char*)(condExp->text_value), "G") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: GREATER\r\n");
    	    			      	    humidity_storage.aggConditions[j].condition = GREATER;
    	    			      	}
    	    			      	else if (strcmp((char*)(condExp->text_value), "GE") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: GREATER_THAN_EQUAL\r\n");
    	    			      	    humidity_storage.aggConditions[j].condition = GREATER_THAN_EQUAL;
    	    			      	 }
    	    			      	 else if (strcmp((char*)(condExp->text_value), "L") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: LESS\r\n");
    	    			      	    humidity_storage.aggConditions[j].condition = LESS;
    	    			      	 }
    	    			      	 else if (strcmp((char*)(condExp->text_value), "LE") == 0) {
    	    			      	    APP_LOG(TS_ON, VLEVEL_L, "code: LESS_THAN_EQUAL\r\n");
    	    			      	    humidity_storage.aggConditions[j].condition = LESS_THAN_EQUAL;
    	    			      	 }
    	    			      }

    	    			    humidity_storage.condSize = j+1;
    	    			  }

    	    			  humidity_storage.AggStateOn = 1;
    			  		  break;
    			  	  default:
    			  		  break;
    			  }
    		  }

    		  // END CONDITION

      	      i = 0;
    	      status = 1;

        	  APP_LOG(TS_ON, VLEVEL_L, "AGGREGATION STATE: %d\r\n", AggStateOn);
      	      APP_LOG(TS_ON, VLEVEL_L, "DATA PARSED CORRECTLY\r\n", (AppLedStateOn));

    	      nx_json_free(rulesArray);
    	  }
    	  else {
    		  status = 0;
          	  APP_LOG(TS_ON, VLEVEL_L, "ERROR WHILE PARSING DATA\r\n", (AppLedStateOn));
    	  }

    	  // Sending "Success" message via uplink
    	  AppData.Port = LORAWAN_USER_APP_PORT;
    	  AppData.Buffer[i++] = (uint8_t)(status & 0xFF);
    	  AppData.BufferSize = i;

    	  if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
    	  {
    	  	APP_LOG(TS_ON, VLEVEL_L, "%d\r\n", (AppData.Buffer));
    	    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
    	  }

    	  break;

      default:

        break;
    }
  }
  APP_LOG(TS_OFF, VLEVEL_L, "###### ======================================\r\n\r\n");
  /* USER CODE END OnRxData_1 */
}

static void CollectMeasurements(void)
{
	uint16_t pressure = 0;
	int16_t temperature = 0;
	uint16_t humidity = 0;

	sensor_t sensor_data;
	int8_t i = 0;

	int8_t collectTemperature = 0;
	int8_t collectPressure = 0;
	int8_t collectHumidity = 0;

	if (AggStateOn == 1)
	{
		APP_LOG(TS_OFF, VLEVEL_L, "\r\n###### ============ COLLECTING MEASUREMENS ============\r\n");
		EnvSensors_Read(&sensor_data);

		for (i = 0; i < temperature_storage.condSize; i++) {
			switch (temperature_storage.aggConditions[i].condition){
				case GREATER:
					if (temperature_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature > temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure > temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity > temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case GREATER_THAN_EQUAL:
					if (temperature_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature >= temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure >= temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity >= temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case LESS:
					if (temperature_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature < temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure < temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity < temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case LESS_THAN_EQUAL:
					if (temperature_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature <= temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure <= temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (temperature_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity <= temperature_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
			}
		}

