sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
		for (i = 0; i < pressure_storage.condSize; i++) {
			switch (pressure_storage.aggConditions[i].condition){
				case GREATER:
					if (pressure_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature > pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure > pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity > pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case GREATER_THAN_EQUAL:
					if (pressure_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature >= pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure >= pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity >= pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case LESS:
					if (pressure_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature < pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure < pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity < pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case LESS_THAN_EQUAL:
					if (pressure_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature <= pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure <= pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (pressure_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity <= pressure_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
			}
		}

		for (i = 0; i < humidity_storage.condSize; i++) {
			switch (humidity_storage.aggConditions[i].condition){
				case GREATER:
					if (humidity_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature > humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure > humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity > humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case GREATER_THAN_EQUAL:
					if (humidity_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature >= humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure >= humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity >= humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case LESS:
					if (humidity_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature < humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure < humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity < humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
				case LESS_THAN_EQUAL:
					if (humidity_storage.aggConditions[i].parameter == TEMPERATURE) {
						if (temperature <= humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == PRESSURE) {
						if (pressure <= humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					else if (humidity_storage.aggConditions[i].parameter == HUMIDITY) {
						if (humidity <= humidity_storage.aggConditions[i].value) {
							collectTemperature++;
						}
					}
					break;
			}
		}

		if (TempDataOn == 1 && ((temperature_storage.condSel == AND && collectTemperature == temperature_storage.condSize) || (temperature_storage.condSel == OR && collectTemperature > 0)) )
		{
			temperature = (SYS_GetTemperatureLevel() >> 8);
			APP_LOG(TS_ON, VLEVEL_L, "temperature: %d\r\n", (temperature));
			temperature_storage.collectedData.count = temperature_storage.collectedData.count + 1;
			temperature_storage.collectedData.sum = temperature_storage.collectedData.sum + temperature;
			temperature_storage.collectedData.sqSum = temperature_storage.collectedData.sqSum + (temperature * temperature);
			if (temperature_storage.collectedData.min > temperature)
			{
				temperature_storage.collectedData.min = temperature;
			}
			else if (temperature_storage.collectedData.max < temperature)
			{
				temperature_storage.collectedData.max = temperature;
			}
		}

		if (PressDataOn == 1 && ((pressure_storage.condSel == AND && collectPressure == pressure_storage.condSize) || (pressure_storage.condSel == OR && collectPressure > 0)))
		{
			pressure    = (uint16_t)(sensor_data.pressure * 100 / 10);  /* in hPa / 10 */
			APP_LOG(TS_ON, VLEVEL_L, "pressure: %d\r\n", (pressure));
			pressure_storage.collectedData.count = (pressure_storage.collectedData.count) + 1;
			pressure_storage.collectedData.sum = pressure_storage.collectedData.sum + pressure;
			pressure_storage.collectedData.sqSum = pressure_storage.collectedData.sqSum + (pressure * pressure);
			if (pressure_storage.collectedData.min > pressure)
			{
				pressure_storage.collectedData.min = pressure;
			}
			else if (pressure_storage.collectedData.max < pressure)
			{
				pressure_storage.collectedData.max = pressure;
			}
		}

