sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
		AppData.Buffer[i++] = battery;      /* 1 (very low) to 254 (fully charged) */
		AppData.Buffer[i++] = (uint8_t)((latitude >> 16) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((latitude >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(latitude & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((longitude >> 16) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((longitude >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(longitude & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((altitudeGps >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(altitudeGps & 0xFF);
		APP_LOG(TS_ON, VLEVEL_L, "battery level: %d\r\n", (battery));
		APP_LOG(TS_ON, VLEVEL_L, "latitude: %d\r\n", (latitude));
		APP_LOG(TS_ON, VLEVEL_L, "longitude: %d\r\n", (longitude));
		APP_LOG(TS_ON, VLEVEL_L, "altitude: %d\r\n", (altitudeGps));
		//  }

		AppData.BufferSize = i;
		//#endif /* CAYENNE_LPP */

		if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
		{
			APP_LOG(TS_ON, VLEVEL_L, "%d\r\n", (AppData.Buffer));
		    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
		}
		else if (nextTxIn > 0)
		{
			APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
		}

		// CLEAN UP

		pressure_storage.collectedData.max = 0;
		pressure_storage.collectedData.min = 0;
		pressure_storage.collectedData.sum = 0;
		pressure_storage.collectedData.count = 0;
		pressure_storage.collectedData.sqSum = 0;
	}
}

static void SendHumidityMeasurements(void)
{
	uint16_t humidity = 0;
	uint16_t humidity_max = 0;
	uint16_t humidity_min = 0;
	uint16_t humidity_sum = 0;
	uint32_t humidity_sqSum = 0;
	uint16_t humidity_avg = 0;
	int16_t humidity_count = 0;

	sensor_t sensor_data;
	UTIL_TIMER_Time_t nextTxIn = 0;

	uint32_t i = 0;
	int32_t latitude = 0;
	int32_t longitude = 0;
	uint8_t battery = 0;
	uint16_t altitudeGps = 0;
	EnvSensors_Read(&sensor_data);

	if (humidity_storage.AggStateOn == 1 && HumDataOn == 1) {
		APP_LOG(TS_OFF, VLEVEL_L, "\r\n###### ============ SENDING HUMIDITY TX DATA ============\r\n");

		if (humidity_storage.AggMaxOn == 1) {
			humidity_max = humidity_storage.collectedData.max;
		}
	   	if (humidity_storage.AggMinOn == 1) {
	   		humidity_min = humidity_storage.collectedData.min;
		}
		if (humidity_storage.AggAvgOn == 1) {
			humidity_avg = humidity_storage.collectedData.sum / humidity_storage.collectedData.count;
		}
		if (humidity_storage.AggSumOn == 1) {
			humidity_sum = humidity_storage.collectedData.sum;
		}
		if (humidity_storage.AggCountOn == 1) {
			humidity_count = humidity_storage.collectedData.count;
		}
		if (humidity_storage.AggSqSumOn == 1) {
			humidity_sqSum = humidity_storage.collectedData.sqSum;
		}

		AppData.Port = LORAWAN_USER_APP_PORT;

		AppData.Buffer[i++] = DATA_AGG_ON;
		AppData.Buffer[i++] = HUMIDITY;
		AppData.Buffer[i++] = humidity_storage.measurementId;
		AppData.Buffer[i++] = humidity_storage.AggMaxOn;
		AppData.Buffer[i++] = humidity_storage.AggMinOn;
		AppData.Buffer[i++] = humidity_storage.AggAvgOn;
		AppData.Buffer[i++] = humidity_storage.AggSumOn;
		AppData.Buffer[i++] = humidity_storage.AggCountOn;
		AppData.Buffer[i++] = humidity_storage.AggSqSumOn;

		if (humidity_storage.AggMaxOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((humidity_max >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(humidity_max & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "humidity max: %d\r\n", (humidity_max));
		}
		if (humidity_storage.AggMinOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((humidity_min >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(humidity_min & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "humidity min: %d\r\n", (humidity_min));
		}
		if (humidity_storage.AggAvgOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((humidity_avg >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(humidity_avg & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "humidity avg: %d\r\n", (humidity_avg));
		}
		if (humidity_storage.AggSumOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((humidity_sum >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(humidity_sum & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "humidity sum: %d\r\n", (humidity_sum));
		}
		if (humidity_storage.AggCountOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(humidity_count & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "humidity count: %d\r\n", (humidity_count));
		}
		if (humidity_storage.AggSqSumOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((humidity_sqSum >> 24) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)((humidity_sqSum >> 16) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)((humidity_sqSum >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(humidity_sqSum & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "humidity sqsum: %d\r\n", (humidity_sqSum));
		}

		latitude = sensor_data.latitude;
		longitude = sensor_data.longitude;
		battery = GetBatteryLevel();

		AppData.Buffer[i++] = battery;      /* 1 (very low) to 254 (fully charged) */
		AppData.Buffer[i++] = (uint8_t)((latitude >> 16) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((latitude >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(latitude & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((longitude >> 16) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((longitude >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(longitude & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((altitudeGps >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(altitudeGps & 0xFF);
		APP_LOG(TS_ON, VLEVEL_L, "battery level: %d\r\n", (battery));
		APP_LOG(TS_ON, VLEVEL_L, "latitude: %d\r\n", (latitude));
		APP_LOG(TS_ON, VLEVEL_L, "longitude: %d\r\n", (longitude));
		APP_LOG(TS_ON, VLEVEL_L, "altitude: %d\r\n", (altitudeGps));
		//  }

		AppData.BufferSize = i;
		//#endif /* CAYENNE_LPP */

		if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
		{
			APP_LOG(TS_ON, VLEVEL_L, "%d\r\n", (AppData.Buffer));
		    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
		}
		else if (nextTxIn > 0)
		{
			APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
		}

		// CLEAN UP

		humidity_storage.collectedData.max = 0;
		humidity_storage.collectedData.min = 0;
		humidity_storage.collectedData.sum = 0;
		humidity_storage.collectedData.count = 0;
		humidity_storage.collectedData.sqSum = 0;
	}

