sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
}

static void SendTxData(void)
{
  /* USER CODE BEGIN SendTxData_1 */

  sensor_t sensor_data;
  UTIL_TIMER_Time_t nextTxIn = 0;

  uint32_t i = 0;
  int32_t latitude = 0;
  int32_t longitude = 0;
  uint8_t battery = 0;
  uint16_t altitudeGps = 0;

  EnvSensors_Read(&sensor_data);

  uint16_t temperature = (SYS_GetTemperatureLevel() >> 8);
  uint16_t pressure    = (uint16_t)(sensor_data.pressure * 100 / 10);      /* in hPa / 10 */
  uint16_t humidity    = (uint16_t)(sensor_data.humidity * 10);

  if (HumDataOn == 0 && TempDataOn == 0 && PressDataOn == 0) {

	  APP_LOG(TS_OFF, VLEVEL_L, "\r\n###### ============ SENDING TX DATA ============\r\n");

  	  AppData.Port = LORAWAN_USER_APP_PORT;

  	  AppData.Buffer[i++] = DATA_AGG_OFF;
  	  AppData.Buffer[i++] = (uint8_t)((pressure >> 8) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)(pressure & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);
  	  APP_LOG(TS_ON, VLEVEL_L, "humidity: %d\r\n", (humidity));
  	  APP_LOG(TS_ON, VLEVEL_L, "temperature: %d\r\n", (temperature));
  	  APP_LOG(TS_ON, VLEVEL_L, "pressure: %d\r\n", (pressure));

  	  APP_LOG(TS_ON, VLEVEL_L, "AppLedStateOn: %d\r\n", (AppLedStateOn));

  	  latitude = sensor_data.latitude;
  	  longitude = sensor_data.longitude;
  	  battery = GetBatteryLevel();

  	  AppData.Buffer[i++] = battery;      /* 1 (very low) to 254 (fully charged) */
  	  AppData.Buffer[i++] = (uint8_t)((latitude >> 16) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)((latitude >> 8) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)(latitude & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)((longitude >> 16) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)((longitude >> 8) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)(longitude & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)((altitudeGps >> 8) & 0xFF);
  	  AppData.Buffer[i++] = (uint8_t)(altitudeGps & 0xFF);
  	  APP_LOG(TS_ON, VLEVEL_L, "battery level: %d\r\n", (battery));
  	  APP_LOG(TS_ON, VLEVEL_L, "latitude: %d\r\n", (latitude));
  	  APP_LOG(TS_ON, VLEVEL_L, "longitude: %d\r\n", (longitude));
  	  APP_LOG(TS_ON, VLEVEL_L, "altitude: %d\r\n", (altitudeGps));

  	  AppData.BufferSize = i;

  	  if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
  	  {
	  	  APP_LOG(TS_ON, VLEVEL_L, "%d\r\n", (AppData.Buffer));
	  	  APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
  	  }
  	  else if (nextTxIn > 0)
  	  {
	  	  APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
  	  }
  }

  /* USER CODE END SendTxData_1 */
}

static void OnMeasureDataTimerEvent(void *context)
{
	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_CollectMeasurmentsEvent), CFG_SEQ_Prio_0);

	/*Wait for next tx slot*/
	UTIL_TIMER_Start(&DataMeasureTimer);
}

static void OnMeasureTemperatureTimerEvent(void *context)
{
	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_CollectMeasurmentsEvent), CFG_SEQ_Prio_0);

	/*Wait for next tx slot*/
	UTIL_TIMER_Start(&DataMeasureTimer);
}

static void OnMeasurePressureTimerEvent(void *context)
{
	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_CollectMeasurmentsEvent), CFG_SEQ_Prio_0);

	/*Wait for next tx slot*/
	UTIL_TIMER_Start(&DataMeasureTimer);
}

static void OnMeasureHumidityTimerEvent(void *context)
{
	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_CollectMeasurmentsEvent), CFG_SEQ_Prio_0);

	/*Wait for next tx slot*/
	UTIL_TIMER_Start(&DataMeasureTimer);
}

static void OnTxTimerEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerEvent_1 */

  /* USER CODE END OnTxTimerEvent_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);

  /*Wait for next tx slot*/
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN OnTxTimerEvent_2 */

  /* USER CODE END OnTxTimerEvent_2 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static void OnTxTimerLedEvent(void *context)
{
  LED_Off(LED_RED2);
}

static void OnRxTimerLedEvent(void *context)
{
  LED_Off(LED_BLUE) ;
}

static void OnJoinTimerLedEvent(void *context)
{
  LED_Toggle(LED_RED1) ;
}

/* USER CODE END PrFD_LedEvents */

static void OnTxData(LmHandlerTxParams_t *params)
{
  /* USER CODE BEGIN OnTxData_1 */
  if ((params != NULL))
  {
    /* Process Tx event only if its a mcps response to prevent some internal events (mlme) */
    if (params->IsMcpsConfirm != 0)
    {
      LED_On(LED_RED2) ;
      UTIL_TIMER_Start(&TxLedTimer);

      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Confirm =============\r\n");
      APP_LOG(TS_OFF, VLEVEL_H, "###### U/L FRAME:%04d | PORT:%d | DR:%d | PWR:%d", params->UplinkCounter,
              params->AppData.Port, params->Datarate, params->TxPower);

      APP_LOG(TS_OFF, VLEVEL_H, " | MSG TYPE:");
      if (params->MsgType == LORAMAC_HANDLER_CONFIRMED_MSG)
      {
        APP_LOG(TS_OFF, VLEVEL_H, "CONFIRMED [%s]\r\n", (params->AckReceived != 0) ? "ACK" : "NACK");
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "UNCONFIRMED\r\n");
      }
    }
  }
  /* USER CODE END OnTxData_1 */
}

static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
  /* USER CODE BEGIN OnJoinRequest_1 */
  if (joinParams != NULL)
  {
    if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
    {
      UTIL_TIMER_Stop(&JoinLedTimer);

      LED_Off(LED_RED1) ;

      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOINED = ");
      if (joinParams->Mode == ACTIVATION_TYPE_ABP)
      {
        APP_LOG(TS_OFF, VLEVEL_M, "ABP ======================\r\n");
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_M, "OTAA =====================\r\n");
      }
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOIN FAILED\r\n");
    }
  }
  /* USER CODE END OnJoinRequest_1 */
}

static void OnMacProcessNotify(void)
{
  /* USER CODE BEGIN OnMacProcessNotify_1 */

  /* USER CODE END OnMacProcessNotify_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);

  /* USER CODE BEGIN OnMacProcessNotify_2 */

  /* USER CODE END OnMacProcessNotify_2 */
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
